Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.0.10/samha1a/atdf/ATSAMHA1G15A.atdf
      <value-group name="WDT_CONFIG__WINDOW">
        <value name="8" caption="8 clock cycles" value="0x0"/>
        <value name="16" caption="16 clock cycles" value="0x1"/>
        <value name="32" caption="32 clock cycles" value="0x2"/>
        <value name="64" caption="64 clock cycles" value="0x3"/>
        <value name="128" caption="128 clock cycles" value="0x4"/>
        <value name="256" caption="256 clock cycles" value="0x5"/>
        <value name="512" caption="512 clock cycles" value="0x6"/>
        <value name="1K" caption="1024 clock cycles" value="0x7"/>
        <value name="2K" caption="2048 clock cycles" value="0x8"/>
        <value name="4K" caption="4096 clock cycles" value="0x9"/>
        <value name="8K" caption="8192 clock cycles" value="0xA"/>
        <value name="16K" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="WDT_EWCTRL__EWOFFSET">
        <value name="8" caption="8 clock cycles" value="0x0"/>
        <value name="16" caption="16 clock cycles" value="0x1"/>
        <value name="32" caption="32 clock cycles" value="0x2"/>
        <value name="64" caption="64 clock cycles" value="0x3"/>
        <value name="128" caption="128 clock cycles" value="0x4"/>
        <value name="256" caption="256 clock cycles" value="0x5"/>
        <value name="512" caption="512 clock cycles" value="0x6"/>
        <value name="1K" caption="1024 clock cycles" value="0x7"/>
        <value name="2K" caption="2048 clock cycles" value="0x8"/>
        <value name="4K" caption="4096 clock cycles" value="0x9"/>
        <value name="8K" caption="8192 clock cycles" value="0xA"/>
        <value name="16K" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="WDT_CLEAR__CLEAR">
        <value name="KEY" caption="Clear Key" value="0xA5"/>
      </value-group>
    </module>
    <module name="NVIC" version="1.0.0" caption="Nested Vectored Interrupt Controller">
      <register-group name="NVIC" caption="Nested Vectored Interrupt Controller">
        <register name="ISER" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Interrupt Set Enable Register">
          <bitfield name="SETENA" caption="Interrupt set enable bits" mask="0x1FFFFFFF"/>
        </register>
        <register name="ICER" offset="0x80" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Interrupt Clear Enable Register">
          <bitfield name="CLRENA" caption="Interrupt clear-enable bits" mask="0x1FFFFFFF"/>
        </register>
        <register name="ISPR" offset="0x100" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Interrupt Set Pending Register">
          <bitfield name="SETPEND" caption="Interrupt set-pending bits" mask="0x1FFFFFFF"/>
        </register>
        <register name="ICPR" offset="0x180" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Interrupt Clear Pending Register">
          <bitfield name="CLRPEND" caption="Interrupt clear-pending bits" mask="0x1FFFFFFF"/>
        </register>
        <register name="IPR" offset="0x300" rw="RW" size="4" access-size="4" count="8" initval="0x00000000" caption="Interrupt Priority Register n">
          <bitfield name="PRI0" caption="Priority of interrupt n" mask="0x3"/>
          <bitfield name="PRI1" caption="Priority of interrupt n" mask="0x300"/>
          <bitfield name="PRI2" caption="Priority of interrupt n" mask="0x30000"/>
          <bitfield name="PRI3" caption="Priority of interrupt n" mask="0x3000000"/>
        </register>
      </register-group>
    </module>
    <module name="SysTick" version="1.0.0" caption="System timer">
      <register-group name="SysTick" caption="System timer">
        <register name="CSR" offset="0x0" rw="RW" size="4" access-size="4" initval="0x4" caption="SysTick Control and Status Register">
          <bitfield name="ENABLE" caption="SysTick Counter Enable" mask="0x1" values="SysTick_CSR__ENABLE"/>
          <bitfield name="TICKINT" caption="SysTick Exception Request Enable" mask="0x2" values="SysTick_CSR__TICKINT"/>
          <bitfield name="CLKSOURCE" caption="Clock Source 0=external, 1=processor" mask="0x4" values="SysTick_CSR__CLKSOURCE"/>
          <bitfield name="COUNTFLAG" caption="Timer counted to 0 since last read of register" mask="0x10000"/>
        </register>
        <register name="RVR" offset="0x4" rw="RW" size="4" access-size="4" caption="SysTick Reload Value Register">
          <bitfield name="RELOAD" caption="Value to load into the SysTick Current Value Register when the counter reaches 0" mask="0xFFFFFF"/>
        </register>
        <register name="CVR" offset="0x8" rw="RW" size="4" access-size="4" caption="SysTick Current Value Register">
          <bitfield name="CURRENT" caption="Current value at the time the register is accessed" mask="0xFFFFFF"/>
        </register>
        <register name="CALIB" offset="0xC" rw="R" size="4" access-size="4" initval="0" caption="SysTick Calibration Value Register">
          <bitfield name="TENMS" caption="Reload value to use for 10ms timing" mask="0xFFFFFF"/>
          <bitfield name="SKEW" caption="TENMS is rounded from non-integer ratio" mask="0x40000000" values="SysTick_CALIB__SKEW"/>
          <bitfield name="NOREF" caption="No Separate Reference Clock" mask="0x80000000" values="SysTick_CALIB__NOREF"/>
        </register>
      </register-group>
      <value-group name="SysTick_CSR__CLKSOURCE">
        <value name="VALUE_0" caption="External clock" value="0"/>
        <value name="VALUE_1" caption="Processor clock" value="1"/>
      </value-group>
      <value-group name="SysTick_CSR__ENABLE">
        <value name="VALUE_0" caption="Counter disabled" value="0"/>
        <value name="VALUE_1" caption="Counter enabled" value="1"/>
      </value-group>
      <value-group name="SysTick_CSR__TICKINT">
        <value name="VALUE_0" caption="Counting down to 0 does not assert the SysTick exception request" value="0"/>
        <value name="VALUE_1" caption="Counting down to 0 asserts the SysTick exception request" value="1"/>
      </value-group>
      <value-group name="SysTick_CALIB__NOREF">
        <value name="VALUE_0" caption="The reference clock is provided" value="0"/>
        <value name="VALUE_1" caption="The reference clock is not provided" value="1"/>
      </value-group>
      <value-group name="SysTick_CALIB__SKEW">
        <value name="VALUE_0" caption="10ms calibration value is exact" value="0"/>
        <value name="VALUE_1" caption="10ms calibration value is inexact, because of the clock frequency" value="1"/>
      </value-group>
    </module>
    <module name="SystemControl" version="1.0.0" caption="System Control Registers">
      <register-group name="SystemControl" caption="System Control Registers">
        <register name="CPUID" offset="0xD00" rw="R" size="4" access-size="4" initval="0x410CC601" caption="CPUID Base Register">
          <bitfield name="REVISION" caption="Minor revision number" mask="0xF"/>
          <bitfield name="PARTNO" caption="Processor Part Number, 0xC60=Cortex-M0+" mask="0xFFF0"/>
          <bitfield name="ARCHITECTURE" caption="Processor Architecture, 0xC=ARMv6-M" mask="0xF0000"/>
          <bitfield name="VARIANT" caption="Major revision number" mask="0xF00000"/>
          <bitfield name="IMPLEMENTER" caption="Implementer code, ARM=0x41" mask="0xFF000000"/>
        </register>
